IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cpu2_periph_ac_regs.xml
	<register id="MCBSPA_AC" width="32" page="1" offset="0x150" internal="0" description="MCBSPA Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="MCBSPB_AC" width="32" page="1" offset="0x152" internal="0" description="MCBSPB Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="USBA_AC" width="32" page="1" offset="0x180" internal="0" description="USBA Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM_AC" width="32" page="1" offset="0x1a8" internal="0" description="HRPWM Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIATX_AC" width="32" page="1" offset="0x1b0" internal="0" description="FSIATX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIARX_AC" width="32" page="1" offset="0x1b2" internal="0" description="FSIARX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIBTX_AC" width="32" page="1" offset="0x1b4" internal="0" description="FSIBTX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIBRX_AC" width="32" page="1" offset="0x1b6" internal="0" description="FSIBRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSICRX_AC" width="32" page="1" offset="0x1ba" internal="0" description="FSICRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIDRX_AC" width="32" page="1" offset="0x1be" internal="0" description="FSIDRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIERX_AC" width="32" page="1" offset="0x1c2" internal="0" description="FSIERX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIFRX_AC" width="32" page="1" offset="0x1c6" internal="0" description="FSIFRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIGRX_AC" width="32" page="1" offset="0x1ca" internal="0" description="FSIGRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIHRX_AC" width="32" page="1" offset="0x1ce" internal="0" description="FSIHRX Master Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="PERIPH_AC_LOCK" width="32" page="1" offset="0x1fe" internal="0" description="Lock Register to stop Write access to peripheral Access register. ">
		<bitfield id="LOCK_AC_WR" description=" Lock control for Access control registers write." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
